conf/src/Documents/ЭП_КорректировкаОтгулов/ЭП_КорректировкаОтгулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭП_КорректировкаОтгулов</name>
  <registerRecords>AccumulationRegister.ЭП_УчетОтгулов</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Корректировка</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ЭП_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвиженияРегистра</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

conf/src/AccumulationRegisters/ЭП_УчетОтгулов/ЭП_УчетОтгулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЭП_УчетОтгулов</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Enums/ВидДвиженияРегистра/ВидДвиженияРегистра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДвиженияРегистра</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Оборот</name>
  </enumValues>
  <enumValues>
    <name>Запись</name>
  </enumValues>
</mdclass:Enum>

conf/src/Documents/ЭП_КорректировкаОтгулов/ObjectModule.bsl
#Область ОбработчикиСобытий

// Движения в регистр накопления ЭП_УчетПремий и ЭП_УчетПремийПоДокументам 
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЭП_УчетОтгулов.Записывать = Истина;
	
	Для Каждого ТекСтрокаКорректировка Из Корректировка Цикл
		
		Движение = Движения.ЭП_УчетОтгулов.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = ТекСтрокаКорректировка.Сотрудник;
		Движение.Длительность = ТекСтрокаКорректировка.Длительность;
		Движение.ВидДвижения = ?(ТекСтрокаКорректировка.ВидДвижения = Перечисления.ВидДвиженияРегистра.Приход,
			ВидДвиженияНакопления.Приход,
			ВидДвиженияНакопления.Расход);
			
	КонецЦикла;
	
	
КонецПроцедуры

// Устанавливает пользователя ответственным за документ
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры 

#КонецОбласти
